---
title: KeyBasedTreeEntry
classe: Autodesk.Revit.DB.KeyBasedTreeEntry
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# KeyBasedTreeEntry

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `keyBasedTreeEntry.IsValidObject` | Boolean |
| `String Key { get; }` | `keyBasedTreeEntry.Key` | String |
| `String ParentKey { get; }` | `keyBasedTreeEntry.ParentKey` | String |
| `Void Dispose()` | `keyBasedTreeEntry.Dispose()` | Void |
| `IList<String> GetChildrenKeys()` | `keyBasedTreeEntry.GetChildrenKeys()` | IList<String> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```